# 2 - 1 시리즈

딕셔너리 -> 시리즈 변환: <span style = "color: blue"> pandas.Series( <span style = "color: green">딕셔너리 <span> ) <span>   

키는 인덱스에 대응, 값은 시리즈의 데이터 값에 대응

In [1]:
import pandas as pd

dict_data = {'a' : 1, 'b' : 2, 'c' : 3}
dict_data

{'a': 1, 'b': 2, 'c': 3}

In [2]:
sr = pd.Series(dict_data)
print(type(sr))

<class 'pandas.core.series.Series'>

In [3]:
print('-' * 40)
print(sr)

----------------------------------------
a    1
b    2
c    3
dtype: int64

# 위치로서의 인덱스도 존재함
- 순서와 주소 모두 저장

In [4]:
# 리스트를 시리즈로 저장
list_data = ['2019-01-01', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
print(sr)
print('\n')

0    2019-01-01
1          3.14
2           ABC
3           100
4          True
dtype: object

In [5]:
list_data2 = [1, 2, 3, 3.0]
sr = pd.Series(list_data2)
print(sr)
print('\n')

0    1.0
1    2.0
2    3.0
3    3.0
dtype: float64

In [6]:
list_data3 = [1, 2, 3]
sr = pd.Series(list_data3)
print(sr)
print('\n')

0    1
1    2
2    3
dtype: int64

#### dtype : object => 문자열
#### dtype : float => 실수형
#### dtype : int => 정수형
##### list_data에서 제일 큰 메모리를 차지하는 자료형으로 dtype결정
##### 정수형 < 실수형 < 문자열

In [7]:
# 인덱스 배열은 변수 idx에 저장. 데이터 값 배열은 변수 val에 저장
idx = sr.index
val = sr.values
print(idx)
print('\n')
print(val)

RangeIndex(start=0, stop=3, step=1)


[1 2 3]

## [ ]의 역할
- 리스트
- 배열
- 위치 인덱스를 지정하기 위한 [ ]

# 원소 선택

### - 원소의 위치를 나타내는 주소 역할을 하는 인덱스를 이용하여   
### 시리즈의 원소를 선택
### - Series['key'], Series[index] 두가지 모두 찾을 수 있음
#### +) Series[['key1', 'key2']] -> 바깥 대괄호는 인덱싱을 위한것 안 대괄호는 전달하기 위한 대괄호

In [8]:
tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index = ['이름', '생년월일', '성별', '학생여부'])   
# index값을 지정,data갯수와 같아야함
print(sr)
print('\n')

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [9]:
print(f'sr의 1번째 원소를 선택 (정수형 위치 인덱스를 활용) -> {sr[0]}')
print(f"'이름' 라벨을 가진 원소를 선택 (인덱스 이름을 활용) -> {sr['이름']}")

sr의 1번째 원소를 선택 (정수형 위치 인덱스를 활용) -> 영인
'이름' 라벨을 가진 원소를 선택 (인덱스 이름을 활용) -> 영인

In [10]:
# 여러개의 원소를 선택
print(sr[[1,2]])
print('\n')
print(sr[['생년월일', '성별']])

생년월일    2010-05-01
성별               여
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

In [11]:
print(f"이름과 생년월일은 -> 이름 : {sr[0]}, 생년월일 : {sr['생년월일']}")

이름과 생년월일은 -> 이름 : 영인, 생년월일 : 2010-05-01

# 2-2 데이터 프레임
- 데이터프레임을 2차원 배열(일반적은 테이블 구조)
- 판다스의 데이터프레임 구조는 통계 package "R" 에서 유래
- 여러개의 시리즈들이 모여있는 구조

- 데이터프레임은 행과 열을 나타내기 위해 두가지 종류의 주소를 사용
- <span style = "color:skyblue"> 열 = 공통 속성, 행 = 다양한 속성 데이터 <span>

딕셔너리 -> 데이터프레임 변환 : <span style = "color:blue"> pandas.DataFrame( <span style = "color:green"> 딕셔너리 객체 <span> ) <span>

In [12]:
import pandas as pd
# 열 이름을 key, 리스트를 value 로 갖는 딕셔너리 정의
dict_data = {'c0' : [1, 2, 3], 'c1' : [4, 5, 6], 'c2' : [7, 8, 9], 'c3' : [10, 11, 12], 'c4' : [13, 14, 15]}
dict_data

{'c0': [1, 2, 3],
 'c1': [4, 5, 6],
 'c2': [7, 8, 9],
 'c3': [10, 11, 12],
 'c4': [13, 14, 15]}

In [13]:
# 판다스 DataFrame() 함수로 딕셔너리를 데이터 프레임으로 변환. 변수 df에 저장
df = pd.DataFrame(dict_data)
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [14]:
# df의 자료형 출력
print(type(df))
print('\n')
print(df)

<class 'pandas.core.frame.DataFrame'>


   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [15]:
display(df)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

## 행 인덱스 / 열 이름 설정
- 데이터프레임 구조적 특성 떄문에 2차원 배열 형태의 데이터를 데이터 프레임으로 변환하기 용이
pandas.DataFrame ( 2차원 배열, index = 행 인덱스 배열, columns = 열 이름 배열)

In [16]:
df = pd.DataFrame([[15, '남', '덕영중'],
                  [17, '여', '수리중']],
                 index = ['준서', '예은'],
                 columns = ['나이', '성별', '학교'])

In [17]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [18]:
print('index -> ', df.index)
print('\n')
print('columns -> ', df.columns)

index ->  Index(['준서', '예은'], dtype='object')


columns ->  Index(['나이', '성별', '학교'], dtype='object')

In [19]:
# 행 인덱스, 열 이름 변경하기
df.index = ['학생1', '학생2']
df.columns = ['연령', '남녀', '소속']

display(df)
print('\n')
print(df.index)
print('\n')
print(df.columns)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

Index(['학생1', '학생2'], dtype='object')


Index(['연령', '남녀', '소속'], dtype='object')

### rename() : 
#### DataFrame 객체.rename ( index = {기존 인덱스 : 새 인덱스, })
#### DataFrame 객체.rename ( columns = {기존 이름 : 새 이름, })

In [20]:
display(df)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [21]:
df.rename(columns = {'연령':'나이', '소속' : '학교'}, inplace = True)
# inplace = True : 바꾼 상태를 유지하라는 명령
# inplace = False : 바꾼 상태를 유지하지 말라는 명령
# default 값은 False
df.rename(index = {'학생1' : '준서', '학생2' : '예은'}, inplace = True)

In [22]:
df

    나이 남녀   학교
준서  15  남  덕영중
예은  17  여  수리중

### 행 / 열 삭제
행 삭제 : DataFrame 객체.drop(행 인덱스, axis = 0)   
열 삭제 : DataFrame 객체.drop(열 이름, axis = 1)

In [23]:
df.drop('준서', inplace = True)

In [24]:
df

    나이 남녀   학교
예은  17  여  수리중

In [25]:
df.drop('나이', axis = 1, inplace = False)
# inplace = False

   남녀   학교
예은  여  수리중

In [26]:
df

    나이 남녀   학교
예은  17  여  수리중

In [27]:
exam_data = {'수학' : [90, 80, 70], '영어' : [98, 89, 95], '음악' : [85, 95, 100], '체육' : [100, 90, 90]}
df = pd.DataFrame(exam_data, index = ['서준', '우현', '인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [28]:
df2 = df.copy()
df2.drop('우현', inplace = True)
df2

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [29]:
df3 = df.copy()
df3.drop(['우현', '인아'], axis = 0, inplace = True)
df3

    수학  영어  음악   체육
서준  90  98  85  100

In [30]:
df4 = df.copy()
df4.drop(['체육', '음악'], axis = 1, inplace = True)
df4

    수학  영어
서준  90  98
우현  80  89
인아  70  95

In [31]:
df5 = df.copy()
df5.drop(['수학'], axis = 1, inplace = True)
df5

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100   90

### 행 선택
- 기존 : df['컬럼명'] 
- loc : 인덱스 이름 ['서준':'인아'] = '서준', '우현', '인아'
- iloc : 정수형 위치 인덱스 [3:7] = 3, 4, 5, 6 <span style = "color:red"> 7 제외 <span>

In [32]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [33]:
label1 = df.loc['서준']
position1 = df.iloc[0]
print('label1(loc)')
display(label1)

print('-' * 40)

print('position1(iloc)')
display(position1)

label1(loc)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

----------------------------------------
position1(iloc)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [34]:
label2 = df.loc[['서준', '인아']]
position2 = df.iloc[[0, 2]]
print('label2(loc)')
display(label2)

print('-' * 40)

print('position2(iloc)')
display(position2)

label2(loc)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

----------------------------------------
position2(iloc)

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [35]:
label3 = df.loc['서준':'우현']
position3 = df.iloc[0:1]
print('label2(loc)')
display(label3)

print('-' * 40)

print('position2(iloc)')
display(position3)

label2(loc)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

----------------------------------------
position2(iloc)

    수학  영어  음악   체육
서준  90  98  85  100

### 열선택
- 열 1개 선택 DataFrame 객체["열 이름"] or DataFrame 객체.열 이름
- 열 n개 선택 DataFrame 객체[ [ 열1, 열2, ... , 열 n ] ]

In [36]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [37]:
math1 = df['수학']
math1

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [38]:
english = df.영어
english

서준    98
우현    89
인아    95
Name: 영어, dtype: int64

In [39]:
exam_data = {'이름' : ['서준', '우현', '인아'],
             '수학' : [90, 80, 70],
             '영어' : [98, 89, 95],
             '음악' : [85, 95, 100],
             '체육' : [100, 90, 90]}
df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [40]:
df.set_index('이름', inplace = True)

In [41]:
music_gym = df[['음악', '체육']] # Series가 2개라서 DataFrame의 형식
music_gym

     음악   체육
이름
서준   85  100
우현   95   90
인아  100   90

In [42]:
math2 = df[['수학']] # DataFrame에서 Series가 1개인 형식
math2

    수학
이름
서준  90
우현  80
인아  70

범위 슬라이싱 : DataFrame 객체.iloc[시작 인덱스 : 끝 인덱스 : 슬라이싱 간격]

In [43]:
df.iloc[0 : 4 : 2] # 0부터 3행까지 2행 간격

    수학  영어   음악   체육
이름
서준  90  98   85  100
인아  70  95  100   90

In [44]:
df.iloc[::2] # 0행부터 끝까지 2행 간격으로 선택

    수학  영어   음악   체육
이름
서준  90  98   85  100
인아  70  95  100   90

### 원소 선택
- 인덱스 이름 : DataFrame 객체.loc[행 인덱스, 열 이름]
- 정수 위치 인덱스 : DataFrame 객체.iloc[행 번호, 열 번호]

In [45]:
df.iloc[0, 2]

85

In [46]:
df.iloc[0, 2:]

음악     85
체육    100
Name: 서준, dtype: int64

In [47]:
a = df.loc['서준', '음악']
a

85

In [48]:
c = df.loc['서준', ['음악', '체육']]
c

음악     85
체육    100
Name: 서준, dtype: int64

In [49]:
d = df.iloc[0, [2, 3]]
d

음악     85
체육    100
Name: 서준, dtype: int64

In [50]:
e = df.loc['서준', '음악':'체육']
e

음악     85
체육    100
Name: 서준, dtype: int64

In [51]:
f = df.iloc[0, 2:]
f

음악     85
체육    100
Name: 서준, dtype: int64

In [52]:
g = df.loc[['서준', '우현'], ['음악', '체육']]
g

    음악   체육
이름
서준  85  100
우현  95   90

In [53]:
h = df.iloc[[0, 1], [2, 3]]
h

    음악   체육
이름
서준  85  100
우현  95   90

In [54]:
i = df.loc['서준':'우현', '음악':'체육']
i

    음악   체육
이름
서준  85  100
우현  95   90

In [55]:
j = df.iloc[0:2, 2:]
j

    음악   체육
이름
서준  85  100
우현  95   90

### 열 추가
- DataFrame 객체[ '추가하려는 열 이름' ] = 데이터 값
- column명, 인덱스 중복 X

In [56]:
df['국어'] = 80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

### 행 추가
- DataFrame 객체 loc[ '추가하려는 행 이름' ] = 데이터 값 (또는 배열) #loc로 이름 추가

In [57]:
df.drop('의찬', axis = 1, inplace = True)

KeyError: "['의찬'] not found in axis"

In [ ]:
exam_data = {'이름' : ['서준', '우현', '인아'],
            '수학' : [90, 80, 70],
            '영어' : [98, 89, 95],
            '음악' : [85, 95, 100],
            '체육' : [100, 90, 90]}

In [ ]:
df = pd.DataFrame(exam_data)
df

In [ ]:
df.loc[3] = 0
df

In [ ]:
df.loc[4] = ['동규', 90, 80, 70, 60]
df

In [ ]:
df.loc['행5'] = df.loc[3]
df

### 원소 값 변경
- DataFrame 객체의 일부분 또는 원소를 선택 = 새로운 값

In [ ]:
df

In [ ]:
df.iloc[0][3] = 80
df

In [ ]:
df.loc['서준']['체육'] = 90
df

In [ ]:
df.loc['서준', '체육'] = 95
df

In [ ]:
df.loc['서준']['음악', '체육'] = 60
df

### 행, 열의 위치 바꾸기
- 선형대수학의 전치행렬과 같은 개념

In [ ]:
df = pd.DataFrame(exam_data)

In [ ]:
df

In [ ]:
df = df.transpose()
df

In [ ]:
df = df.T
df

In [ ]:
df.set_index('이름', inplace = True)

In [ ]:
df = df.T
df

### 특정열을 행 인덱스로 설정
- set_index() 데이터프레임의 특정열을 행 인덱스로 설정
- DataFrame 객체.set_index([ '객체 명' ] or '객체 명')

In [ ]:
df = pd.DataFrame(exam_data)

In [ ]:
df

In [ ]:
ndf = df.set_index(['이름'])
ndf

In [ ]:
ndf2 = ndf.set_index('음악')
ndf2

In [ ]:
ndf3 = ndf.set_index(['수학', '음악']) #멀티 인덱스 구조
ndf3

### 행 인덱스 재배열
- reindex

In [ ]:
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
df

In [ ]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf = df.reindex(new_index)
ndf

- NULL = 없다
- 0 = 휴지심
- NaN = 휴지 대신 사포

In [ ]:
type(ndf.loc['r3']['c0'])

In [ ]:
new_index = ['r0', 'r1', 'r2', 'r3', 'r4']
ndf2 = df.reindex(new_index, fill_value = 0) 
ndf2

#### fill_value = 값

In [ ]:
df = pd.DataFrame(dict_data, index = ['r0', 'r1', 'r2'])
df

#### reset_index() -> index 수 재정의

In [ ]:
ndf = df.reset_index() #기존 인덱스는 따로 정의
ndf

### 특정 열의 데이터 값을 기준으로 데이터프레임 정렬하기
- DataFrame 객체.sort_values()

In [ ]:
ndf = df.sort_values(by = 'c1', ascending = False)
ndf

# 4. 산술연산

- 판다스 객체의 산술연산은 내부적으로 3단계 프로세스를 거친다.

## 4-1 시리즈 연산
### 시리즈 vs 숫자
##### Series객체 + 연산자 + 숫자

In [ ]:
student1 = pd.Series({'국어':100, '영어': 80,'수학':90})
display(student1)

In [ ]:
percentage = student1 / 200

In [ ]:
display(percentage)

### 시리즈 vs 시리즈
- 시리즈의 모든 인덱스에 대하여 같은 인덱스를 가진 원소끼리 계산
- 인덱스에 연산 결과를 매칭하여 새 시리즈를 반환

### Series1 + 연산 + Series2
양쪽 중 하나의 값에 NaN이나 빈 값이 있는 경우 최종 연산은 NaN   
=> NaN이랑 연산이 불가능

In [ ]:
student1 = pd.Series({'국어':100, '영어': 80,'수학':90})
student2 = pd.Series({'수학':80, '국어': 90,'영어':80})

display(student1)
print('-' * 40)
display(student2)

In [ ]:
addition = student1 + student2 # 순서에 상관없이 연관되어 있는 것끼리 연산해줌
subtraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2
print(type(division))

In [ ]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
                     index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
display(result)

In [ ]:
import numpy as np # NaN값을 다루기 위함

student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

display(student1)
print('-'*40)
display(student2)

In [ ]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
                     index = ['덧셈', '뺄셈', '곱셈', '나눗셈'])
display(result)

### 연산 메소드
- fill_value 옵션을 설정하여 NaN 값을 다른 값으로 변경하여줌
- Series1.add(Series2, fill_value = 0)

In [ ]:
student1 = pd.Series({'국어':np.nan, '영어':80, '수학':90})
student2 = pd.Series({'수학':80, '국어':90})

In [ ]:
sr_add = student1.add(student2, fill_value = 0)
sr_sub = student1.sub(student2, fill_value = 0)
sr_mul = student1.mul(student2, fill_value = 0)
sr_div = student1.div(student2, fill_value = 0)

result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div],
                     index = ['덧셈', '뺼셈', '곱셈', '나눗셈'])
result

### 데이터프레임 연산

- DataFrame객체 + 연산자 + 숫자

In [ ]:
import seaborn as sns

titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]

df.head() # head(n) 상위 n개만 default = 5

In [ ]:
addition = df + 10 # 전체 + 10
addition.head()

In [ ]:
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age', 'fare']]
df.tail()

In [ ]:
addition  = df + 10
addition.tail()

In [ ]:
subtraction = addition - df
subtraction.tail()